inference/inference-LEONARDO/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_2-GPUs_8-TP_4-PP_1-MaxModelLength_4096/launch-1/logs_benchmarking_500-concurrency.log
INFO 04-02 10:13:17 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sonnet', dataset_path='/leonardo_work/MNRVA_bench/datasets/sonnet.txt', max_concurrency=500, model='/leonardo_work/MNRVA_bench/models/Llama-3.1-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_work/MNRVA_bench/minerva-benchmarks/inference/inference-LEONARDO/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_2-GPUs_8-TP_4-PP_1-MaxModelLength_4096/launch-1/Concurrency_500.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 500
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  20.01     
Total input tokens:                      509089    
Total generated tokens:                  150000    
Request throughput (req/s):              49.98     
Output token throughput (tok/s):         7497.59   
Total Token throughput (tok/s):          32943.87  
---------------Time to First Token----------------
Mean TTFT (ms):                          3950.37   
Median TTFT (ms):                        5055.60   
P99 TTFT (ms):                           5799.81   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          32.16     
Median TPOT (ms):                        33.32     
P99 TPOT (ms):                           33.57     
---------------Inter-token Latency----------------
Mean ITL (ms):                           32.16     
Median ITL (ms):                         30.54     
P99 ITL (ms):                            56.82     
==================================================